import React, {useEffect, useRef, useState} from "react";

import { ArticleListsComponent } from "./ArticleListsComponent"

type ArticleListsProps = {
	category: {
		id: number;
		title: string;
		isShow: boolean;
	}
}

const ArticleListsContainer = ({ category }: ArticleListsProps) => {
	const swiperRef = useRef<any>();

	const all_data = [
		{
			title: 'Новинки',
			data: [
			{
				id: 1,
				title: 'Свитшот Бананчик',
				description: 'Хлопковый костюмчик с веселой банановой расцветкой.',
				image: 'https://asiastore.kg/image/cachewebp/catalog/garmin/edge/fenix7solar/garminfenix7solarslategrayblackband/41fc35a8e311c769637279c4286d4000-670x540.webp',
				price: 600,
				sell_price: 1200,
				percentage: 50,
				content_data: [
					{
						key: 'S',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
					{
						key: 'M',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
					{
						key: 'L',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
				]
			},
			{
				id: 2,
				title: 'Худи Милитари',
				description: 'Новый взгляд на милитари расцветку! На капюшоне также имеется принт.',
				image: 'https://asiastore.kg/image/cachewebp/catalog/mac/pro14m1/4d97b19a-13e5-4b89-83ee-b80d2ba22ad6-670x540.webp',
				price: 1800,
				sell_price: null,
				percentage: null,
				content_data: [
					{
						key: 'S',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
					{
						key: 'M',
						value: 'Длина по спинке: 26-29см; обхват груди: 40-44см; обхват шеи: 24-27см.',
					},
					{
						key: 'L',
						value: 'Длина по спинке: 28-32см; обхват груди: 46-50см; обхват шеи: 305мм.',
					},
				]
			},
			{
				id: 3,
				title: 'Худи Champion',
				description: 'Яркое хлопкое худи с начесом.',
				image: 'https://storage.my2can.com/sklimages/7576/60b7830b545fe.png',
				price: 6490,
				sell_price: 9260,
				percentage: 29,
				content_data: [
					{
						key: 'S',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
					{
						key: 'M',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
					{
						key: 'L',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
				]
			},
			{
				id: 4,
				title: 'Худи Колор-блок',
				description: 'Контрастное худи из хлопка без начеса. Идеально для теплой весны.',
				image: 'https://storage.my2can.com/sklimages/7576/60b7834e032da.png',
				price: 1200,
				sell_price: null,
				percentage: null,
				content_data: [
					{
						key: 'S',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
					{
						key: 'M',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
					{
						key: 'L',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
				]
			},
			{
				id: 5,
				title: 'Свитшот Бананчик',
				description: 'Хлопковый костюмчик с веселой банановой расцветкой.',
				image: 'https://storage.my2can.com/sklimages/7576/76df4dcfc0e3dd237eb9c2ec43f6f058_800x800.jpg',
				price: 600,
				sell_price: 1200,
				percentage: 50,
				content_data: [
					{
						key: 'S',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
					{
						key: 'M',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
					{
						key: 'L',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
				]
			},
			{
				id: 6,
				title: 'Худи Милитари',
				description: 'Новый взгляд на милитари расцветку! На капюшоне также имеется принт.',
				image: 'https://storage.my2can.com/sklimages/7576/60b7835d6f9e7.png',
				price: 1800,
				sell_price: null,
				percentage: null,
				content_data: [
					{
						key: 'S',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
					{
						key: 'M',
						value: 'Длина по спинке: 26-29см; обхват груди: 40-44см; обхват шеи: 24-27см.',
					},
					{
						key: 'L',
						value: 'Длина по спинке: 28-32см; обхват груди: 46-50см; обхват шеи: 305мм.',
					},
				]
			},
			{
				id: 7,
				title: 'Худи Champion',
				description: 'Яркое хлопкое худи с начесом.',
				image: 'https://storage.my2can.com/sklimages/7576/60b77fa03fd78.png',
				price: 6490,
				sell_price: 9260,
				percentage: 29,
				content_data: [
					{
						key: 'S',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
					{
						key: 'M',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
					{
						key: 'L',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
				]
			},
			{
				id: 8,
				title: 'Худи Колор-блок',
				description: 'Контрастное худи из хлопка без начеса. Идеально для теплой весны.',
				image: 'https://storage.my2can.com/sklimages/7576/60b7834e032da.png',
				price: 1200,
				sell_price: null,
				percentage: null,
				content_data: [
					{
						key: 'S',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
					{
						key: 'M',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
					{
						key: 'L',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
				]
			},
			{
				id: 9,
				title: 'Свитшот Бананчик',
				description: 'Хлопковый костюмчик с веселой банановой расцветкой.',
				image: 'https://storage.my2can.com/sklimages/7576/76df4dcfc0e3dd237eb9c2ec43f6f058_800x800.jpg',
				price: 600,
				sell_price: 1200,
				percentage: 50,
				content_data: [
					{
						key: 'S',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
					{
						key: 'M',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
					{
						key: 'L',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
				]
			},
			{
				id: 10,
				title: 'Худи Милитари',
				description: 'Новый взгляд на милитари расцветку! На капюшоне также имеется принт.',
				image: 'https://storage.my2can.com/sklimages/7576/60b7835d6f9e7.png',
				price: 1800,
				sell_price: null,
				percentage: null,
				content_data: [
					{
						key: 'S',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
					{
						key: 'M',
						value: 'Длина по спинке: 26-29см; обхват груди: 40-44см; обхват шеи: 24-27см.',
					},
					{
						key: 'L',
						value: 'Длина по спинке: 28-32см; обхват груди: 46-50см; обхват шеи: 305мм.',
					},
				]
			},
			{
				id: 11,
				title: 'Худи Champion',
				description: 'Яркое хлопкое худи с начесом.',
				image: 'https://storage.my2can.com/sklimages/7576/76df4dcfc0e3dd237eb9c2ec43f6f058_800x800.jpg',
				price: 6490,
				sell_price: 9260,
				percentage: 29,
				content_data: [
					{
						key: 'S',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
					{
						key: 'M',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
					{
						key: 'L',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
				]
			},
			{
				id: 12,
				title: 'Худи Колор-блок',
				description: 'Контрастное худи из хлопка без начеса. Идеально для теплой весны.',
				image: 'https://storage.my2can.com/sklimages/7576/60b7834e032da.png',
				price: 1200,
				sell_price: null,
				percentage: null,
				content_data: [
					{
						key: 'S',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
					{
						key: 'M',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
					{
						key: 'L',
						value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
					},
				]
			}
		]
		},
		{
			title: 'Одежда',
			data: [
				{
					id: 1,
					title: 'Свитшот Бананчик',
					description: 'Хлопковый костюмчик с веселой банановой расцветкой.',
					image: 'https://storage.my2can.com/sklimages/7576/76df4dcfc0e3dd237eb9c2ec43f6f058_800x800.jpg',
					price: 600,
					sell_price: 1200,
					percentage: 50,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				},
				{
					id: 2,
					title: 'Худи Милитари',
					description: 'Новый взгляд на милитари расцветку! На капюшоне также имеется принт.',
					image: 'https://storage.my2can.com/sklimages/7576/60b7835d6f9e7.png',
					price: 1800,
					sell_price: null,
					percentage: null,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 26-29см; обхват груди: 40-44см; обхват шеи: 24-27см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 28-32см; обхват груди: 46-50см; обхват шеи: 305мм.',
						},
					]
				},
				{
					id: 3,
					title: 'Худи Champion',
					description: 'Яркое хлопкое худи с начесом.',
					image: 'https://storage.my2can.com/sklimages/7576/60b7830b545fe.png',
					price: 6490,
					sell_price: 9260,
					percentage: 29,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				},
				{
					id: 4,
					title: 'Худи Колор-блок',
					description: 'Контрастное худи из хлопка без начеса. Идеально для теплой весны.',
					image: 'https://storage.my2can.com/sklimages/7576/60b7834e032da.png',
					price: 1200,
					sell_price: null,
					percentage: null,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				},
				{
					id: 5,
					title: 'Свитшот Бананчик',
					description: 'Хлопковый костюмчик с веселой банановой расцветкой.',
					image: 'https://storage.my2can.com/sklimages/7576/76df4dcfc0e3dd237eb9c2ec43f6f058_800x800.jpg',
					price: 600,
					sell_price: 1200,
					percentage: 50,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				},
				{
					id: 6,
					title: 'Худи Милитари',
					description: 'Новый взгляд на милитари расцветку! На капюшоне также имеется принт.',
					image: 'https://storage.my2can.com/sklimages/7576/60b7835d6f9e7.png',
					price: 1800,
					sell_price: null,
					percentage: null,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 26-29см; обхват груди: 40-44см; обхват шеи: 24-27см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 28-32см; обхват груди: 46-50см; обхват шеи: 305мм.',
						},
					]
				},
				{
					id: 7,
					title: 'Худи Champion',
					description: 'Яркое хлопкое худи с начесом.',
					image: 'https://storage.my2can.com/sklimages/7576/60b77fa03fd78.png',
					price: 6490,
					sell_price: 9260,
					percentage: 29,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				},
				{
					id: 8,
					title: 'Худи Колор-блок',
					description: 'Контрастное худи из хлопка без начеса. Идеально для теплой весны.',
					image: 'https://storage.my2can.com/sklimages/7576/60b7834e032da.png',
					price: 1200,
					sell_price: null,
					percentage: null,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				},
				{
					id: 9,
					title: 'Свитшот Бананчик',
					description: 'Хлопковый костюмчик с веселой банановой расцветкой.',
					image: 'https://storage.my2can.com/sklimages/7576/76df4dcfc0e3dd237eb9c2ec43f6f058_800x800.jpg',
					price: 600,
					sell_price: 1200,
					percentage: 50,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				},
				{
					id: 10,
					title: 'Худи Милитари',
					description: 'Новый взгляд на милитари расцветку! На капюшоне также имеется принт.',
					image: 'https://storage.my2can.com/sklimages/7576/60b7835d6f9e7.png',
					price: 1800,
					sell_price: null,
					percentage: null,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 26-29см; обхват груди: 40-44см; обхват шеи: 24-27см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 28-32см; обхват груди: 46-50см; обхват шеи: 305мм.',
						},
					]
				},
				{
					id: 11,
					title: 'Худи Champion',
					description: 'Яркое хлопкое худи с начесом.',
					image: 'https://storage.my2can.com/sklimages/7576/76df4dcfc0e3dd237eb9c2ec43f6f058_800x800.jpg',
					price: 6490,
					sell_price: 9260,
					percentage: 29,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				},
				{
					id: 12,
					title: 'Худи Колор-блок',
					description: 'Контрастное худи из хлопка без начеса. Идеально для теплой весны.',
					image: 'https://storage.my2can.com/sklimages/7576/60b7834e032da.png',
					price: 1200,
					sell_price: null,
					percentage: null,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				}
			]
		},
		{
			title: 'Поводки',
			data: [
				{
					id: 1,
					title: 'Свитшот Бананчик',
					description: 'Хлопковый костюмчик с веселой банановой расцветкой.',
					image: 'https://storage.my2can.com/sklimages/7576/76df4dcfc0e3dd237eb9c2ec43f6f058_800x800.jpg',
					price: 600,
					sell_price: 1200,
					percentage: 50,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				},
				{
					id: 2,
					title: 'Худи Милитари',
					description: 'Новый взгляд на милитари расцветку! На капюшоне также имеется принт.',
					image: 'https://storage.my2can.com/sklimages/7576/60b7835d6f9e7.png',
					price: 1800,
					sell_price: null,
					percentage: null,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 26-29см; обхват груди: 40-44см; обхват шеи: 24-27см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 28-32см; обхват груди: 46-50см; обхват шеи: 305мм.',
						},
					]
				},
				{
					id: 3,
					title: 'Худи Champion',
					description: 'Яркое хлопкое худи с начесом.',
					image: 'https://storage.my2can.com/sklimages/7576/60b7830b545fe.png',
					price: 6490,
					sell_price: 9260,
					percentage: 29,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				},
				{
					id: 4,
					title: 'Худи Колор-блок',
					description: 'Контрастное худи из хлопка без начеса. Идеально для теплой весны.',
					image: 'https://storage.my2can.com/sklimages/7576/60b7834e032da.png',
					price: 1200,
					sell_price: null,
					percentage: null,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				},
				{
					id: 5,
					title: 'Свитшот Бананчик',
					description: 'Хлопковый костюмчик с веселой банановой расцветкой.',
					image: 'https://storage.my2can.com/sklimages/7576/76df4dcfc0e3dd237eb9c2ec43f6f058_800x800.jpg',
					price: 600,
					sell_price: 1200,
					percentage: 50,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				},
				{
					id: 6,
					title: 'Худи Милитари',
					description: 'Новый взгляд на милитари расцветку! На капюшоне также имеется принт.',
					image: 'https://storage.my2can.com/sklimages/7576/60b7835d6f9e7.png',
					price: 1800,
					sell_price: null,
					percentage: null,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 26-29см; обхват груди: 40-44см; обхват шеи: 24-27см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 28-32см; обхват груди: 46-50см; обхват шеи: 305мм.',
						},
					]
				},
				{
					id: 7,
					title: 'Худи Champion',
					description: 'Яркое хлопкое худи с начесом.',
					image: 'https://storage.my2can.com/sklimages/7576/60b77fa03fd78.png',
					price: 6490,
					sell_price: 9260,
					percentage: 29,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				},
				{
					id: 8,
					title: 'Худи Колор-блок',
					description: 'Контрастное худи из хлопка без начеса. Идеально для теплой весны.',
					image: 'https://storage.my2can.com/sklimages/7576/60b7834e032da.png',
					price: 1200,
					sell_price: null,
					percentage: null,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				},
				{
					id: 9,
					title: 'Свитшот Бананчик',
					description: 'Хлопковый костюмчик с веселой банановой расцветкой.',
					image: 'https://storage.my2can.com/sklimages/7576/76df4dcfc0e3dd237eb9c2ec43f6f058_800x800.jpg',
					price: 600,
					sell_price: 1200,
					percentage: 50,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				},
				{
					id: 10,
					title: 'Худи Милитари',
					description: 'Новый взгляд на милитари расцветку! На капюшоне также имеется принт.',
					image: 'https://storage.my2can.com/sklimages/7576/60b7835d6f9e7.png',
					price: 1800,
					sell_price: null,
					percentage: null,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 26-29см; обхват груди: 40-44см; обхват шеи: 24-27см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 28-32см; обхват груди: 46-50см; обхват шеи: 305мм.',
						},
					]
				},
				{
					id: 11,
					title: 'Худи Champion',
					description: 'Яркое хлопкое худи с начесом.',
					image: 'https://storage.my2can.com/sklimages/7576/76df4dcfc0e3dd237eb9c2ec43f6f058_800x800.jpg',
					price: 6490,
					sell_price: 9260,
					percentage: 29,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				},
				{
					id: 12,
					title: 'Худи Колор-блок',
					description: 'Контрастное худи из хлопка без начеса. Идеально для теплой весны.',
					image: 'https://storage.my2can.com/sklimages/7576/60b7834e032da.png',
					price: 1200,
					sell_price: null,
					percentage: null,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				}
			]
		},
		{
			title: 'Ошейники',
			data: [
				{
					id: 1,
					title: 'Свитшот Бананчик',
					description: 'Хлопковый костюмчик с веселой банановой расцветкой.',
					image: 'https://storage.my2can.com/sklimages/7576/76df4dcfc0e3dd237eb9c2ec43f6f058_800x800.jpg',
					price: 600,
					sell_price: 1200,
					percentage: 50,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				},
				{
					id: 2,
					title: 'Худи Милитари',
					description: 'Новый взгляд на милитари расцветку! На капюшоне также имеется принт.',
					image: 'https://storage.my2can.com/sklimages/7576/60b7835d6f9e7.png',
					price: 1800,
					sell_price: null,
					percentage: null,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 26-29см; обхват груди: 40-44см; обхват шеи: 24-27см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 28-32см; обхват груди: 46-50см; обхват шеи: 305мм.',
						},
					]
				},
				{
					id: 3,
					title: 'Худи Champion',
					description: 'Яркое хлопкое худи с начесом.',
					image: 'https://storage.my2can.com/sklimages/7576/60b7830b545fe.png',
					price: 6490,
					sell_price: 9260,
					percentage: 29,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				},
				{
					id: 4,
					title: 'Худи Колор-блок',
					description: 'Контрастное худи из хлопка без начеса. Идеально для теплой весны.',
					image: 'https://storage.my2can.com/sklimages/7576/60b7834e032da.png',
					price: 1200,
					sell_price: null,
					percentage: null,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				},
				{
					id: 5,
					title: 'Свитшот Бананчик',
					description: 'Хлопковый костюмчик с веселой банановой расцветкой.',
					image: 'https://storage.my2can.com/sklimages/7576/76df4dcfc0e3dd237eb9c2ec43f6f058_800x800.jpg',
					price: 600,
					sell_price: 1200,
					percentage: 50,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				},
				{
					id: 6,
					title: 'Худи Милитари',
					description: 'Новый взгляд на милитари расцветку! На капюшоне также имеется принт.',
					image: 'https://storage.my2can.com/sklimages/7576/60b7835d6f9e7.png',
					price: 1800,
					sell_price: null,
					percentage: null,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 26-29см; обхват груди: 40-44см; обхват шеи: 24-27см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 28-32см; обхват груди: 46-50см; обхват шеи: 305мм.',
						},
					]
				},
				{
					id: 7,
					title: 'Худи Champion',
					description: 'Яркое хлопкое худи с начесом.',
					image: 'https://storage.my2can.com/sklimages/7576/60b77fa03fd78.png',
					price: 6490,
					sell_price: 9260,
					percentage: 29,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				},
				{
					id: 8,
					title: 'Худи Колор-блок',
					description: 'Контрастное худи из хлопка без начеса. Идеально для теплой весны.',
					image: 'https://storage.my2can.com/sklimages/7576/60b7834e032da.png',
					price: 1200,
					sell_price: null,
					percentage: null,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				},
				{
					id: 9,
					title: 'Свитшот Бананчик',
					description: 'Хлопковый костюмчик с веселой банановой расцветкой.',
					image: 'https://storage.my2can.com/sklimages/7576/76df4dcfc0e3dd237eb9c2ec43f6f058_800x800.jpg',
					price: 600,
					sell_price: 1200,
					percentage: 50,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				},
				{
					id: 10,
					title: 'Худи Милитари',
					description: 'Новый взгляд на милитари расцветку! На капюшоне также имеется принт.',
					image: 'https://storage.my2can.com/sklimages/7576/60b7835d6f9e7.png',
					price: 1800,
					sell_price: null,
					percentage: null,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 26-29см; обхват груди: 40-44см; обхват шеи: 24-27см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 28-32см; обхват груди: 46-50см; обхват шеи: 305мм.',
						},
					]
				},
				{
					id: 11,
					title: 'Худи Champion',
					description: 'Яркое хлопкое худи с начесом.',
					image: 'https://storage.my2can.com/sklimages/7576/76df4dcfc0e3dd237eb9c2ec43f6f058_800x800.jpg',
					price: 6490,
					sell_price: 9260,
					percentage: 29,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				},
				{
					id: 12,
					title: 'Худи Колор-блок',
					description: 'Контрастное худи из хлопка без начеса. Идеально для теплой весны.',
					image: 'https://storage.my2can.com/sklimages/7576/60b7834e032da.png',
					price: 1200,
					sell_price: null,
					percentage: null,
					content_data: [
						{
							key: 'S',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'M',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
						{
							key: 'L',
							value: 'Длина по спинке: 22-25см; обхват груди: 36-40см; обхват шеи: 20-24см.',
						},
					]
				}
			]
		},
	];

	return (
		all_data
			.filter((data2: any) => data2.title === category.title)
			.map((data2: any, ix: any) => <ArticleListsComponent key={ix} swiperRef={swiperRef} title={data2?.title} data={data2?.data} />)
	)
}

export { ArticleListsContainer }
